artifacts/oscar_e2e/fig4_groups_sweep_qwen3_4b_thinking/bf16/in100000_bs32_g1/bench_serving.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=32400, ready_check_timeout_sec=60, dataset_name='generated-shared-prefix', dataset_path='', model=None, served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=1, gsp_prompts_per_group=32, gsp_system_prompt_len=100000, gsp_question_len=128, gsp_output_len=1000, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:32400/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=32400, ready_check_timeout_sec=60, dataset_name='generated-shared-prefix', dataset_path='', model='Qwen/Qwen3-4B-Thinking-2507', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=1, gsp_prompts_per_group=32, gsp_system_prompt_len=100000, gsp_question_len=128, gsp_output_len=1000, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)


Loading cached generated input data from /root/.cache/sglang/benchmark/gen_shared_prefix_1_1_32_100000_128_1000_Qwen2Tokenizer.pkl
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     32        
Benchmark duration (s):                  120.43    
Total input tokens:                      3371395   
Total input text tokens:                 3371395   
Total generated tokens:                  32000     
Total generated tokens (retokenized):    31918     
Request throughput (req/s):              0.27      
Input token throughput (tok/s):          27994.17  
Output token throughput (tok/s):         265.71    
Peak output token throughput (tok/s):    1406.00   
Peak concurrent requests:                32        
Total token throughput (tok/s):          28259.88  
Concurrency:                             30.99     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   116615.88 
Median E2E Latency (ms):                 117768.46 
P90 E2E Latency (ms):                    120018.89 
P99 E2E Latency (ms):                    120304.17 
---------------Time to First Token----------------
Mean TTFT (ms):                          9816.22   
Median TTFT (ms):                        9980.72   
P99 TTFT (ms):                           10085.88  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          106.91    
Median TPOT (ms):                        107.91    
P99 TPOT (ms):                           110.33    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           106.91    
Median ITL (ms):                         114.04    
P95 ITL (ms):                            115.11    
P99 ITL (ms):                            129.56    
Max ITL (ms):                            2274.62   
==================================================
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [01:48<56:12, 108.79s/it]
  6%|▋         | 2/32 [01:49<22:37, 45.27s/it] 
  9%|▉         | 3/32 [01:50<12:05, 25.01s/it]
 12%|█▎        | 4/32 [01:51<07:13, 15.47s/it]
 16%|█▌        | 5/32 [01:51<04:33, 10.12s/it]
 19%|█▉        | 6/32 [01:52<02:59,  6.92s/it]
 22%|██▏       | 7/32 [01:53<02:01,  4.85s/it]
 25%|██▌       | 8/32 [01:54<01:24,  3.54s/it]
 28%|██▊       | 9/32 [01:54<01:00,  2.61s/it]
 31%|███▏      | 10/32 [01:55<00:43,  1.96s/it]
 34%|███▍      | 11/32 [01:55<00:31,  1.52s/it]
 38%|███▊      | 12/32 [01:56<00:24,  1.24s/it]
 41%|████      | 13/32 [01:56<00:19,  1.03s/it]
 44%|████▍     | 14/32 [01:57<00:14,  1.22it/s]
 47%|████▋     | 15/32 [01:57<00:11,  1.54it/s]
 50%|█████     | 16/32 [01:57<00:08,  1.80it/s]
 53%|█████▎    | 17/32 [01:57<00:06,  2.15it/s]
 56%|█████▋    | 18/32 [01:58<00:05,  2.34it/s]
 59%|█████▉    | 19/32 [01:58<00:04,  2.66it/s]
 62%|██████▎   | 20/32 [01:58<00:04,  2.94it/s]
 66%|██████▌   | 21/32 [01:59<00:03,  3.26it/s]
 69%|██████▉   | 22/32 [01:59<00:02,  3.91it/s]
 72%|███████▏  | 23/32 [01:59<00:02,  4.26it/s]
 75%|███████▌  | 24/32 [01:59<00:01,  4.88it/s]
 78%|███████▊  | 25/32 [01:59<00:01,  5.42it/s]
 84%|████████▍ | 27/32 [01:59<00:00,  6.60it/s]
 88%|████████▊ | 28/32 [01:59<00:00,  6.77it/s]
 94%|█████████▍| 30/32 [02:00<00:00,  7.49it/s]
100%|██████████| 32/32 [02:00<00:00,  8.36it/s]
100%|██████████| 32/32 [02:00<00:00,  3.76s/it]